package xiaohongshu

/*
-1000400 请求参数错误，包括非空错误以及值错误
-1000401 401没有权限
-1000500 Inter Server Error

-1009001 未找到类目的子类目
-1009002 未找到属性
-1009003 类目没有对应属性
-1009004 类目没有描述属性
-1009005 类目没有销售属性
-1010001 获取商家信息出错

-1040015 商品不属于本商家
-1040039 spu的商家不匹配

------------------------------

-2000101 包裹不存在或不属于此商家

-2000201 包裹数据异常
-2000202 包裹状态错误
-2000203 包裹已停止履约（查看是否有取消申请）

-2000301 更新包裹状态失败
-2000302 更新订单包裹状态失败
-2000303 更新包裹失败

-2000400 请求参数错误
-2000401 无权限

-2000500 系统调用异常
-2000502 业务验证异常

--------------------------------

-4002004 接口报错
-4002005 接口报错
-4002007 接口报错

-4009001 spu不存在/未找到商家，请重新尝试
-4009006 类目不可售卖
-4009007 店铺存在同名商品
-4009013 商品正参与预售，不可更改物流方案
-4009014 spu必填字段未填写，请补全后重试
-4009015 输入的商品类目不合规
-4009016 上下架失败具体原因
-4009017 暂时无法通过开放平台更新商品类目，请使用新版编辑页面更新
-4009018 商品不能删除/spu不包含该规格信息
-4009019 前商品规格信息与SPU规格信息不符
-4009020 当前spu有在架上商品，不允许修改规格信息，请先下架商品
-4009025 未找到item
-4009027 商品必填信息未填写
-4009028 规格不属于类目
-4009029 当前操作会产生重复商品，请核对商品规格信息与打包数信息

-4009203 渠道商品不允许修改库存数

-4009501 objectId无效
-4009502 短标题过长，字段超出规定大小
-4009503 物流模式不存在
-4009505 规格值不属于该规格

-4009600 更新物流方案失败具体原因
-4009601 创建spu失败/接口报错
-4009602 更新spu失败
-4009603 创建item失败
-4009604 更新item失败
-4009607 接口报错
-4009608 接口报错

-4009901 重新上架商品失败，errMessage展示具体愿意

-------------------------------

-5009001 找不到商家，请重新尝试
-5009015 商品不属于本商家
-5009025 未找到itemId，请重新尝试
-5009026 该商品不允许修改库存
-5009030 暂时无法通过开放平台更新组合商品库存数，请使用新版编辑页进行更改

-5009202 库存总数不能小于0

-5009501 不是有效的ObjectId

-5009604 接口报错
*/
